### Terraform Plan — `prod`

```
module.doubleday.null_resource.lambda_deps: Refreshing state... [id=6882248154193062499]
module.doubleday.null_resource.lambda_package_build: Refreshing state... [id=6250757282135232566]
module.doubleday.data.aws_secretsmanager_secret_version.google_oauth: Reading...
module.doubleday.module.api.data.aws_route53_zone.main: Reading...
module.doubleday.module.api.aws_api_gateway_api_key.main: Refreshing state... [id=c6ovg8u1u3]
module.doubleday.module.frontend.data.aws_route53_zone.main: Reading...
module.doubleday.module.api.aws_iam_role.authorizer_invocation: Refreshing state... [id=doubleday-prod-api-auth-invocation]
module.doubleday.module.api.aws_acm_certificate.api: Refreshing state... [id=arn:aws:acm:us-east-1:291743709387:certificate/94bb2757-1f28-4105-b42e-59e70ffdd193]
module.doubleday.module.lambda.aws_iam_role.check_failures: Refreshing state... [id=doubleday-prod-check-failures]
module.doubleday.module.s3.aws_s3_bucket.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.doubleday.module.api.aws_api_gateway_rest_api.main: Refreshing state... [id=pxul356jj2]
module.doubleday.module.glue.aws_glue_catalog_database.main: Refreshing state... [id=291743709387:doubleday_prod]
module.doubleday.module.lambda.aws_iam_role.clear_staging: Refreshing state... [id=doubleday-prod-clear-staging]
module.doubleday.module.cognito.aws_cognito_user_pool.main: Refreshing state... [id=us-east-1_yTSoyLxrZ]
module.doubleday.module.api.aws_iam_role.authorizer: Refreshing state... [id=doubleday-prod-api-authorizer]
module.doubleday.data.aws_secretsmanager_secret_version.google_oauth: Read complete after 1s [id=prod/doubleday/cognito_identity_provider/google_client_id|AWSCURRENT]
module.doubleday.module.lambda.aws_iam_role.gold_load: Refreshing state... [id=doubleday-prod-gold-load]
module.doubleday.module.lambda.aws_iam_role.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load]
module.doubleday.module.frontend.aws_s3_bucket.frontend: Refreshing state... [id=doubleday-prod-frontend]
module.doubleday.module.frontend.aws_acm_certificate.frontend: Refreshing state... [id=arn:aws:acm:us-east-1:291743709387:certificate/38f2c4c5-9963-464a-a43a-ffa06250aab4]
module.doubleday.module.step_function.aws_cloudwatch_log_group.pipeline: Refreshing state... [id=/aws/stepfunction/doubleday-prod-pipeline]
module.doubleday.module.frontend.aws_cloudfront_function.spa_routing: Refreshing state... [id=doubleday-prod-spa-routing]
module.doubleday.module.dashboard.aws_cloudwatch_dashboard.pipeline: Refreshing state... [id=doubleday-prod-pipeline]
module.doubleday.module.api.data.aws_route53_zone.main: Read complete after 1s [id=Z1WGWAH1KA6CLS]
module.doubleday.module.frontend.aws_cloudfront_origin_access_control.frontend: Refreshing state... [id=E1LGVHQGU0CMC8]
module.doubleday.module.frontend.aws_cloudfront_function.strip_api_prefix: Refreshing state... [id=doubleday-prod-strip-api-prefix]
module.doubleday.module.step_function.aws_iam_role.pipeline: Refreshing state... [id=doubleday-prod-pipeline]
module.doubleday.module.lambda.aws_iam_role.validate_input: Refreshing state... [id=doubleday-prod-validate-input]
module.doubleday.module.frontend.data.aws_route53_zone.main: Read complete after 1s [id=Z1WGWAH1KA6CLS]
module.doubleday.module.lambda.aws_iam_role.silver_load: Refreshing state... [id=doubleday-prod-silver-load]
module.doubleday.module.api.aws_iam_role.query_pitches: Refreshing state... [id=doubleday-prod-api-query-pitches]
module.doubleday.module.api.aws_api_gateway_resource.pitchers: Refreshing state... [id=uwqig2]
module.doubleday.module.api.aws_iam_role_policy.authorizer: Refreshing state... [id=doubleday-prod-api-authorizer:doubleday-prod-api-authorizer]
module.doubleday.module.s3.aws_s3_bucket_public_access_block.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.doubleday.module.s3.aws_s3_bucket_server_side_encryption_configuration.lakehouse: Refreshing state... [id=doubleday-prod-lakehouse]
module.doubleday.module.api.aws_route53_record.cert_validation["api.doubleday.appleforge.com"]: Refreshing state... [id=Z1WGWAH1KA6CLS__4635bde1f5c6e4e6d211eab974c1a2c5.api.doubleday.appleforge.com._CNAME]
module.doubleday.module.frontend.aws_route53_record.cert_validation["doubleday.appleforge.com"]: Refreshing state... [id=Z1WGWAH1KA6CLS__7d799900fc948135bb9557ad87d84f64.doubleday.appleforge.com._CNAME]
module.doubleday.module.api.aws_api_gateway_resource.pitcher: Refreshing state... [id=8jwml5]
module.doubleday.module.lambda.aws_iam_role_policy.validate_input: Refreshing state... [id=doubleday-prod-validate-input:doubleday-prod-validate-input]
module.doubleday.module.lambda.aws_lambda_function.validate_input: Refreshing state... [id=doubleday-prod-validate-input]
module.doubleday.module.lambda.aws_lambda_function.clear_staging: Refreshing state... [id=doubleday-prod-clear-staging]
module.doubleday.module.lambda.aws_lambda_function.gold_load: Refreshing state... [id=doubleday-prod-gold-load]
module.doubleday.module.glue.null_resource.gold_pitches_shape_season_table: Refreshing state... [id=3679298051484024578]
module.doubleday.module.glue.aws_glue_catalog_table.bronze_statcast: Refreshing state... [id=291743709387:doubleday_prod:bronze_statcast]
module.doubleday.module.lambda.aws_lambda_function.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load]
module.doubleday.module.lambda.aws_lambda_function.check_failures: Refreshing state... [id=doubleday-prod-check-failures]
module.doubleday.module.glue.null_resource.silver_pitches_table: Refreshing state... [id=6545119109490943370]
module.doubleday.module.lambda.aws_iam_role_policy.gold_load: Refreshing state... [id=doubleday-prod-gold-load:doubleday-prod-gold-load]
module.doubleday.module.lambda.aws_iam_role_policy.clear_staging: Refreshing state... [id=doubleday-prod-clear-staging:doubleday-prod-clear-staging]
module.doubleday.module.lambda.aws_iam_role_policy.check_failures: Refreshing state... [id=doubleday-prod-check-failures:doubleday-prod-check-failures]
module.doubleday.module.lambda.aws_iam_role_policy.bronze_load: Refreshing state... [id=doubleday-prod-bronze-load:doubleday-prod-bronze-load]
module.doubleday.module.lambda.aws_lambda_function.silver_load: Refreshing state... [id=doubleday-prod-silver-load]
module.doubleday.module.lambda.aws_iam_role_policy.silver_load: Refreshing state... [id=doubleday-prod-silver-load:doubleday-prod-silver-load]
module.doubleday.module.api.aws_api_gateway_resource.pitches: Refreshing state... [id=s69w9x]
module.doubleday.module.api.aws_iam_role_policy.query_pitches: Refreshing state... [id=doubleday-prod-api-query-pitches:doubleday-prod-api-query-pitches]
module.doubleday.module.api.aws_lambda_function.query_pitches: Refreshing state... [id=doubleday-prod-api-query-pitches]
module.doubleday.module.cognito.aws_cognito_user_pool_domain.main: Refreshing state... [id=doubleday-prod]
module.doubleday.module.cognito.aws_cognito_identity_provider.google: Refreshing state... [id=us-east-1_yTSoyLxrZ:Google]
module.doubleday.module.frontend.aws_acm_certificate_validation.frontend: Refreshing state... [id=2026-02-17 19:07:51.332 +0000 UTC]
module.doubleday.module.api.aws_acm_certificate_validation.api: Refreshing state... [id=2026-02-17 19:08:55.709 +0000 UTC]
module.doubleday.module.glue.null_resource.silver_pitches_staging_table: Refreshing state... [id=1918109444834322555]
module.doubleday.module.frontend.aws_s3_bucket_public_access_block.frontend: Refreshing state... [id=doubleday-prod-frontend]
module.doubleday.module.frontend.aws_s3_bucket_server_side_encryption_configuration.frontend: Refreshing state... [id=doubleday-prod-frontend]
module.doubleday.module.api.aws_api_gateway_method.options_pitches: Refreshing state... [id=agm-pxul356jj2-s69w9x-OPTIONS]
module.doubleday.module.cognito.aws_cognito_user_pool_client.main: Refreshing state... [id=d1hu206js00272bcol6h5b08j]
module.doubleday.module.api.aws_api_gateway_domain_name.main: Refreshing state... [id=api.doubleday.appleforge.com]
module.doubleday.module.api.aws_api_gateway_method_response.options_pitches: Refreshing state... [id=agmr-pxul356jj2-s69w9x-OPTIONS-200]
module.doubleday.module.api.aws_api_gateway_integration.options_pitches: Refreshing state... [id=agi-pxul356jj2-s69w9x-OPTIONS]
module.doubleday.module.step_function.aws_iam_role_policy.pipeline: Refreshing state... [id=doubleday-prod-pipeline:doubleday-prod-pipeline]
module.doubleday.module.step_function.aws_sfn_state_machine.pipeline: Refreshing state... [id=arn:aws:states:us-east-1:291743709387:stateMachine:doubleday-prod-pipeline]
module.doubleday.module.api.aws_route53_record.api: Refreshing state... [id=Z1WGWAH1KA6CLS_api.doubleday.appleforge.com_A]
module.doubleday.module.api.aws_api_gateway_integration_response.options_pitches: Refreshing state... [id=agir-pxul356jj2-s69w9x-OPTIONS-200]
module.doubleday.module.api.aws_lambda_permission.query_pitches: Refreshing state... [id=AllowAPIGatewayInvoke]
module.doubleday.module.frontend.aws_cloudfront_distribution.main: Refreshing state... [id=E1LQ1KQZVIS7N3]
module.doubleday.module.api.aws_lambda_function.authorizer: Refreshing state... [id=doubleday-prod-api-authorizer]
module.doubleday.module.frontend.aws_s3_bucket_policy.frontend: Refreshing state... [id=doubleday-prod-frontend]
module.doubleday.module.frontend.aws_route53_record.frontend: Refreshing state... [id=Z1WGWAH1KA6CLS_doubleday.appleforge.com_A]
module.doubleday.module.api.aws_lambda_permission.authorizer: Refreshing state... [id=AllowAPIGatewayInvoke]
module.doubleday.module.api.aws_iam_role_policy.authorizer_invocation: Refreshing state... [id=doubleday-prod-api-auth-invocation:doubleday-prod-api-auth-invocation]
module.doubleday.module.api.aws_api_gateway_authorizer.cognito: Refreshing state... [id=7wjic4]
module.doubleday.module.api.aws_api_gateway_method.get_pitches: Refreshing state... [id=agm-pxul356jj2-s69w9x-GET]
module.doubleday.module.api.aws_api_gateway_integration.get_pitches: Refreshing state... [id=agi-pxul356jj2-s69w9x-GET]
module.doubleday.module.api.aws_api_gateway_deployment.main: Refreshing state... [id=olrbq7]
module.doubleday.module.api.aws_api_gateway_stage.main: Refreshing state... [id=ags-pxul356jj2-prod]
module.doubleday.module.api.aws_api_gateway_base_path_mapping.main: Refreshing state... [id=api.doubleday.appleforge.com/]
module.doubleday.module.api.aws_api_gateway_usage_plan.main: Refreshing state... [id=xzahru]
module.doubleday.module.api.aws_api_gateway_usage_plan_key.main: Refreshing state... [id=c6ovg8u1u3]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
+/- create replacement and then destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.doubleday.data.archive_file.lambda_package will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "lambda_package" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/doubleday/../../../builds/lambda_package.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/doubleday/../../../builds/lambda_package"
      + type                = "zip"
    }

  # module.doubleday.null_resource.lambda_package_build must be replaced
+/- resource "null_resource" "lambda_package_build" {
      ~ id       = "6250757282135232566" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "sql_api_hash"  = "ba67b3a4e68a7e6e689fb06dacd850e4138aa75a" -> "656022b95bea15ba7324c8f7783554e0f6e9c292"
          ~ "sql_pipe_hash" = "6c3750313ed25c434d1fffa7ad5809cf9f2b26c1" -> "7bf428a49cfeb981ec0e733ebb30905dc880b631"
          ~ "src_hash"      = "4240ec25746d02006704822b5de57e98b75e28e6" -> "b3e293cec6bf5fb1c4227df158ee624e44224e0d"
            # (1 unchanged element hidden)
        }
    }

  # module.doubleday.module.api.aws_api_gateway_deployment.main must be replaced
+/- resource "aws_api_gateway_deployment" "main" {
      ~ created_date  = "2026-02-17T15:49:57Z" -> (known after apply)
      ~ execution_arn = "arn:aws:execute-api:us-east-1:291743709387:pxul356jj2/" -> (known after apply)
      ~ id            = "olrbq7" -> (known after apply)
      ~ invoke_url    = "https://pxul356jj2.execute-api.us-east-1.amazonaws.com/" -> (known after apply)
      ~ triggers      = {
          - "redeployment" = "9eebc9d11393d3e811765f0424f904de2fccd43e"
        } -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.doubleday.module.api.aws_api_gateway_integration.get_catalog will be created
  + resource "aws_api_gateway_integration" "get_catalog" {
      + cache_namespace         = (known after apply)
      + connection_type         = "INTERNET"
      + http_method             = "GET"
      + id                      = (known after apply)
      + integration_http_method = "POST"
      + passthrough_behavior    = (known after apply)
      + resource_id             = (known after apply)
      + rest_api_id             = "pxul356jj2"
      + timeout_milliseconds    = 29000
      + type                    = "AWS_PROXY"
      + uri                     = (known after apply)
    }

  # module.doubleday.module.api.aws_api_gateway_integration.options_catalog will be created
  + resource "aws_api_gateway_integration" "options_catalog" {
      + cache_namespace      = (known after apply)
      + connection_type      = "INTERNET"
      + http_method          = "OPTIONS"
      + id                   = (known after apply)
      + passthrough_behavior = (known after apply)
      + request_templates    = {
          + "application/json" = jsonencode(
                {
                  + statusCode = 200
                }
            )
        }
      + resource_id          = (known after apply)
      + rest_api_id          = "pxul356jj2"
      + timeout_milliseconds = 29000
      + type                 = "MOCK"
    }

  # module.doubleday.module.api.aws_api_gateway_integration_response.options_catalog will be created
  + resource "aws_api_gateway_integration_response" "options_catalog" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = "'Content-Type,Authorization'"
          + "method.response.header.Access-Control-Allow-Methods" = "'GET,OPTIONS'"
          + "method.response.header.Access-Control-Allow-Origin"  = "'*'"
        }
      + rest_api_id         = "pxul356jj2"
      + status_code         = "200"
    }

  # module.doubleday.module.api.aws_api_gateway_method.get_catalog will be created
  + resource "aws_api_gateway_method" "get_catalog" {
      + api_key_required = true
      + authorization    = "CUSTOM"
      + authorizer_id    = "7wjic4"
      + http_method      = "GET"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "pxul356jj2"
    }

  # module.doubleday.module.api.aws_api_gateway_method.options_catalog will be created
  + resource "aws_api_gateway_method" "options_catalog" {
      + api_key_required = false
      + authorization    = "NONE"
      + http_method      = "OPTIONS"
      + id               = (known after apply)
      + resource_id      = (known after apply)
      + rest_api_id      = "pxul356jj2"
    }

  # module.doubleday.module.api.aws_api_gateway_method_response.options_catalog will be created
  + resource "aws_api_gateway_method_response" "options_catalog" {
      + http_method         = "OPTIONS"
      + id                  = (known after apply)
      + resource_id         = (known after apply)
      + response_models     = {
          + "application/json" = "Empty"
        }
      + response_parameters = {
          + "method.response.header.Access-Control-Allow-Headers" = true
          + "method.response.header.Access-Control-Allow-Methods" = true
          + "method.response.header.Access-Control-Allow-Origin"  = true
        }
      + rest_api_id         = "pxul356jj2"
      + status_code         = "200"
    }

  # module.doubleday.module.api.aws_api_gateway_resource.catalog_role will be created
  + resource "aws_api_gateway_resource" "catalog_role" {
      + id          = (known after apply)
      + parent_id   = (known after apply)
      + path        = (known after apply)
      + path_part   = "{role}"
      + rest_api_id = "pxul356jj2"
    }

  # module.doubleday.module.api.aws_api_gateway_resource.catalogs will be created
  + resource "aws_api_gateway_resource" "catalogs" {
      + id          = (known after apply)
      + parent_id   = "nperz2yh8f"
      + path        = (known after apply)
      + path_part   = "catalogs"
      + rest_api_id = "pxul356jj2"
    }

  # module.doubleday.module.api.aws_api_gateway_stage.main will be updated in-place
  ~ resource "aws_api_gateway_stage" "main" {
      ~ deployment_id         = "olrbq7" -> (known after apply)
        id                    = "ags-pxul356jj2-prod"
        tags                  = {}
        # (14 unchanged attributes hidden)
    }

  # module.doubleday.module.api.aws_iam_role.catalog will be created
  + resource "aws_iam_role" "catalog" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "doubleday-prod-api-catalog"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.doubleday.module.api.aws_iam_role_policy.catalog will be created
  + resource "aws_iam_role_policy" "catalog" {
      + id          = (known after apply)
      + name        = "doubleday-prod-api-catalog"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "s3:GetObject"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::doubleday-prod-frontend/static/catalogs/*"
                    },
                  + {
                      + Action    = "s3:ListBucket"
                      + Condition = {
                          + StringLike = {
                              + "s3:prefix" = [
                                  + "static/catalogs/*",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:s3:::doubleday-prod-frontend"
                    },
                  + {
                      + Action   = "cloudwatch:PutMetricData"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.doubleday.module.api.aws_lambda_function.authorizer will be updated in-place
  ~ resource "aws_lambda_function" "authorizer" {
        id                             = "doubleday-prod-api-authorizer"
      ~ last_modified                  = "2026-02-17T19:41:58.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvTQSrc7/cktRKMy4xhRRxolECxP5O9jvEu1U7rmIMU=" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.api.aws_lambda_function.catalog will be created
  + resource "aws_lambda_function" "catalog" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/doubleday/../../../builds/lambda_package.zip"
      + function_name                  = "doubleday-prod-api-catalog"
      + handler                        = "doubleday.api.catalog.handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:017000801446:layer:AWSLambdaPowertoolsPythonV3-python312-x86_64:15",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + timeout                        = 10
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "FRONTEND_BUCKET"              = "doubleday-prod-frontend"
              + "POWERTOOLS_METRICS_NAMESPACE" = "Doubleday"
              + "POWERTOOLS_SERVICE_NAME"      = "api_catalog"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.doubleday.module.api.aws_lambda_function.query_pitches will be updated in-place
  ~ resource "aws_lambda_function" "query_pitches" {
        id                             = "doubleday-prod-api-query-pitches"
      ~ last_modified                  = "2026-02-17T19:41:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvTQSrc7/cktRKMy4xhRRxolECxP5O9jvEu1U7rmIMU=" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.api.aws_lambda_permission.catalog will be created
  + resource "aws_lambda_permission" "catalog" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "doubleday-prod-api-catalog"
      + id                  = (known after apply)
      + principal           = "apigateway.amazonaws.com"
      + source_arn          = "arn:aws:execute-api:us-east-1:291743709387:pxul356jj2/*"
      + statement_id        = "AllowAPIGatewayInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.doubleday.module.cognito.aws_cognito_identity_provider.google will be updated in-place
  ~ resource "aws_cognito_identity_provider" "google" {
        id                = "us-east-1_yTSoyLxrZ:Google"
      ~ provider_details  = {
          - "attributes_url"                = "https://people.googleapis.com/v1/people/me?personFields=" -> null
          - "attributes_url_add_attributes" = "true" -> null
          - "authorize_url"                 = "https://accounts.google.com/o/oauth2/v2/auth" -> null
          - "oidc_issuer"                   = "https://accounts.google.com" -> null
          - "token_request_method"          = "POST" -> null
          - "token_url"                     = "https://www.googleapis.com/oauth2/v4/token" -> null
            # (3 unchanged elements hidden)
        }
        # (5 unchanged attributes hidden)
    }

  # module.doubleday.module.glue.null_resource.gold_pitches_shape_season_table is tainted, so must be replaced
-/+ resource "null_resource" "gold_pitches_shape_season_table" {
      ~ id       = "3679298051484024578" -> (known after apply)
      ~ triggers = {
          ~ "sql_hash" = "0cec3f67d4abec20c989f48fd8de01c0" -> "14fbd9c50eaf4de196f2e3e291140039"
        }
    }

  # module.doubleday.module.lambda.aws_iam_role.catalog_build will be created
  + resource "aws_iam_role" "catalog_build" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "doubleday-prod-catalog-build"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.doubleday.module.lambda.aws_iam_role_policy.catalog_build will be created
  + resource "aws_iam_role_policy" "catalog_build" {
      + id          = (known after apply)
      + name        = "doubleday-prod-catalog-build"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "athena:StartQueryExecution",
                          + "athena:GetQueryExecution",
                          + "athena:GetQueryResults",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "glue:GetDatabase",
                          + "glue:GetTable",
                          + "glue:GetPartitions",
                          + "glue:UpdateTable",
                          + "glue:CreateTable",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:ListBucket",
                          + "s3:DeleteObject",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::doubleday-prod-lakehouse",
                          + "arn:aws:s3:::doubleday-prod-lakehouse/*",
                          + "arn:aws:s3:::appleforge-athena-query-results",
                          + "arn:aws:s3:::appleforge-athena-query-results/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:PutObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3:::doubleday-prod-frontend/static/catalogs/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "cloudwatch:PutMetricData",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "logs:CreateLogGroup",
                          + "logs:CreateLogStream",
                          + "logs:PutLogEvents",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:logs:*:*:*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

  # module.doubleday.module.lambda.aws_lambda_function.bronze_load will be updated in-place
  ~ resource "aws_lambda_function" "bronze_load" {
        id                             = "doubleday-prod-bronze-load"
      ~ last_modified                  = "2026-02-17T19:41:51.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvTQSrc7/cktRKMy4xhRRxolECxP5O9jvEu1U7rmIMU=" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.catalog_build will be created
  + resource "aws_lambda_function" "catalog_build" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + filename                       = "../../modules/doubleday/../../../builds/lambda_package.zip"
      + function_name                  = "doubleday-prod-catalog-build"
      + handler                        = "doubleday.pipeline.catalog_build.handler.handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + layers                         = [
          + "arn:aws:lambda:us-east-1:017000801446:layer:AWSLambdaPowertoolsPythonV3-python312-x86_64:15",
        ]
      + memory_size                    = 128
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = {
          + "Environment" = "prod"
          + "Project"     = "doubleday"
        }
      + timeout                        = 900
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "ATHENA_OUTPUT_BUCKET"         = "appleforge-athena-query-results"
              + "FRONTEND_BUCKET"              = "doubleday-prod-frontend"
              + "GLUE_DATABASE"                = "doubleday_prod"
              + "LAKEHOUSE_BUCKET"             = "doubleday-prod-lakehouse"
              + "POWERTOOLS_METRICS_NAMESPACE" = "Doubleday"
              + "POWERTOOLS_SERVICE_NAME"      = "catalog_build"
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # module.doubleday.module.lambda.aws_lambda_function.check_failures will be updated in-place
  ~ resource "aws_lambda_function" "check_failures" {
        id                             = "doubleday-prod-check-failures"
      ~ last_modified                  = "2026-02-17T19:41:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvTQSrc7/cktRKMy4xhRRxolECxP5O9jvEu1U7rmIMU=" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.clear_staging will be updated in-place
  ~ resource "aws_lambda_function" "clear_staging" {
        id                             = "doubleday-prod-clear-staging"
      ~ last_modified                  = "2026-02-17T19:41:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvTQSrc7/cktRKMy4xhRRxolECxP5O9jvEu1U7rmIMU=" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.gold_load will be updated in-place
  ~ resource "aws_lambda_function" "gold_load" {
        id                             = "doubleday-prod-gold-load"
      ~ last_modified                  = "2026-02-17T19:41:14.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvTQSrc7/cktRKMy4xhRRxolECxP5O9jvEu1U7rmIMU=" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.silver_load will be updated in-place
  ~ resource "aws_lambda_function" "silver_load" {
        id                             = "doubleday-prod-silver-load"
      ~ last_modified                  = "2026-02-17T19:41:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvTQSrc7/cktRKMy4xhRRxolECxP5O9jvEu1U7rmIMU=" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.lambda.aws_lambda_function.validate_input will be updated in-place
  ~ resource "aws_lambda_function" "validate_input" {
        id                             = "doubleday-prod-validate-input"
      ~ last_modified                  = "2026-02-17T19:41:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "hvTQSrc7/cktRKMy4xhRRxolECxP5O9jvEu1U7rmIMU=" -> (known after apply)
        tags                           = {}
        # (27 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.doubleday.module.step_function.aws_iam_role_policy.pipeline will be updated in-place
  ~ resource "aws_iam_role_policy" "pipeline" {
        id          = "doubleday-prod-pipeline:doubleday-prod-pipeline"
        name        = "doubleday-prod-pipeline"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-validate-input",
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-bronze-load",
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-silver-load",
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-gold-load",
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-clear-staging",
                          - "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-check-failures",
                        ]
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogDelivery",
                          - "logs:GetLogDelivery",
                          - "logs:UpdateLogDelivery",
                          - "logs:DeleteLogDelivery",
                          - "logs:ListLogDeliveries",
                          - "logs:PutResourcePolicy",
                          - "logs:DescribeResourcePolicies",
                          - "logs:DescribeLogGroups",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.doubleday.module.step_function.aws_sfn_state_machine.pipeline will be updated in-place
  ~ resource "aws_sfn_state_machine" "pipeline" {
      ~ definition                = jsonencode(
            {
              - Comment = "Doubleday ETL pipeline: validate → bronze → silver → gold"
              - StartAt = "ValidateInput"
              - States  = {
                  - BronzeLoadMap = {
                      - InputPath      = "$"
                      - ItemsPath      = "$.game_dates"
                      - Iterator       = {
                          - StartAt = "BronzeLoad"
                          - States  = {
                              - BronzeLoad = {
                                  - End        = true
                                  - Parameters = {
                                      - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-bronze-load"
                                      - "Payload.$"  = "$"
                                    }
                                  - Resource   = "arn:aws:states:::lambda:invoke"
                                  - ResultPath = "$.bronze_result"
                                  - Type       = "Task"
                                }
                            }
                        }
                      - MaxConcurrency = 5
                      - Next           = "SilverLoadMap"
                      - Parameters     = {
                          - "force_download.$" = "$.force_download"
                          - "game_date.$"      = "$$.Map.Item.Value"
                          - "season.$"         = "$.season"
                        }
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - CheckFailures = {
                      - Next           = "HasFailures"
                      - Parameters     = {
                          - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-check-failures"
                          - Payload      = {
                              - "batch_id.$" = "$.batch_id"
                            }
                        }
                      - Resource       = "arn:aws:states:::lambda:invoke"
                      - ResultPath     = "$.check_result"
                      - ResultSelector = {
                          - "failed_game_dates.$" = "$.Payload.failed_game_dates"
                          - "failure_count.$"     = "$.Payload.failure_count"
                          - "failure_summary.$"   = "$.Payload.failure_summary"
                        }
                      - Type           = "Task"
                    }
                  - ClearStaging  = {
                      - Next       = "SetGoldTables"
                      - Parameters = {
                          - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-clear-staging"
                          - Payload      = {
                              - "batch_id.$" = "$.batch_id"
                            }
                        }
                      - Resource   = "arn:aws:states:::lambda:invoke"
                      - ResultPath = null
                      - Type       = "Task"
                    }
                  - GoldLoadMap   = {
                      - InputPath      = "$"
                      - ItemsPath      = "$.gold_tables"
                      - Iterator       = {
                          - StartAt = "GoldLoad"
                          - States  = {
                              - GoldLoad = {
                                  - End        = true
                                  - Parameters = {
                                      - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-gold-load"
                                      - "Payload.$"  = "$"
                                    }
                                  - Resource   = "arn:aws:states:::lambda:invoke"
                                  - ResultPath = "$.gold_result"
                                  - Type       = "Task"
                                }
                            }
                        }
                      - MaxConcurrency = 1
                      - Next           = "CheckFailures"
                      - Parameters     = {
                          - "season.$"     = "$.season"
                          - "table_name.$" = "$$.Map.Item.Value"
                        }
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - HasFailures   = {
                      - Choices = [
                          - {
                              - Next               = "PipelineFail"
                              - NumericGreaterThan = 0
                              - Variable           = "$.check_result.failure_count"
                            },
                        ]
                      - Default = "Succeed"
                      - Type    = "Choice"
                    }
                  - PipelineFail  = {
                      - CausePath = "$.check_result.failure_summary"
                      - Error     = "SilverLoadPartialFailure"
                      - Type      = "Fail"
                    }
                  - SetGoldTables = {
                      - Next       = "GoldLoadMap"
                      - Result     = [
                          - "gold_pitches_shape_season",
                        ]
                      - ResultPath = "$.gold_tables"
                      - Type       = "Pass"
                    }
                  - SilverLoadMap = {
                      - InputPath      = "$"
                      - ItemsPath      = "$.game_dates"
                      - Iterator       = {
                          - StartAt = "SilverLoad"
                          - States  = {
                              - SilverLoad      = {
                                  - Catch      = [
                                      - {
                                          - ErrorEquals = [
                                              - "States.ALL",
                                            ]
                                          - Next        = "SilverLoadCatch"
                                          - ResultPath  = "$.error"
                                        },
                                    ]
                                  - End        = true
                                  - Parameters = {
                                      - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-silver-load"
                                      - "Payload.$"  = "$"
                                    }
                                  - Resource   = "arn:aws:states:::lambda:invoke"
                                  - ResultPath = "$.silver_result"
                                  - Type       = "Task"
                                }
                              - SilverLoadCatch = {
                                  - End  = true
                                  - Type = "Pass"
                                }
                            }
                        }
                      - MaxConcurrency = 5
                      - Next           = "ClearStaging"
                      - Parameters     = {
                          - "batch_id.$"  = "$.batch_id"
                          - "game_date.$" = "$$.Map.Item.Value"
                          - "season.$"    = "$.season"
                        }
                      - ResultPath     = null
                      - Type           = "Map"
                    }
                  - Succeed       = {
                      - Type = "Succeed"
                    }
                  - ValidateInput = {
                      - Next           = "BronzeLoadMap"
                      - Parameters     = {
                          - FunctionName = "arn:aws:lambda:us-east-1:291743709387:function:doubleday-prod-validate-input"
                          - "Payload.$"  = "$"
                        }
                      - Resource       = "arn:aws:states:::lambda:invoke"
                      - ResultPath     = "$"
                      - ResultSelector = {
                          - "batch_id.$"       = "$.Payload.batch_id"
                          - "force_download.$" = "$.Payload.force_download"
                          - "game_dates.$"     = "$.Payload.game_dates"
                          - "season.$"         = "$.Payload.season"
                        }
                      - Type           = "Task"
                    }
                }
            }
        ) -> (known after apply)
        id                        = "arn:aws:states:us-east-1:291743709387:stateMachine:doubleday-prod-pipeline"
        name                      = "doubleday-prod-pipeline"
        tags                      = {}
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

Plan: 18 to add, 12 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

*Triggered by @dcbove in #14*